# WaveColor2 Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Wave..::..WaveColor2 Property
Wave Class See Also
---
The property labeled "Color 2" from the "Wave" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string WaveColor2 { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WaveColor2 As String
	Get
```

Visual C++
---
```text
public:
static property String^ WaveColor2 {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.
# See Also
Wave Class
Autodesk.Revit.DB.Visual Namespace